```
krishna@turbotindias-MacBook-Pro azure_check_regions % terraform apply --var-file=demo.tfvars                          
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.azure_approved_regions will be created
  + resource "turbot_policy_setting" "azure_approved_regions" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure#/policy/types/approvedRegionsDefault"
      + value                        = <<~EOT
            - "eastus"
            - "eastus2"
            
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-aks-managed-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-aks#/policy/types/managedClusterApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-apimanagement-service"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-apimanagement#/policy/types/apiManagementServiceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-application-gateway"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-applicationgateway#/policy/types/applicationGatewayApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-application-insights-insight"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-applicationinsights#/policy/types/applicationInsightApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-function-app"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-appservice#/policy/types/functionAppApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-plan"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-appservice#/policy/types/appServicePlanApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-availability-set"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/availabilitySetApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/diskApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk-encryption-set"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/diskEncryptionSetApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-image"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/imageApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/snapshotApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-virtual-machine"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-cosmosdb-database"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/databaseAccountApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-databricks-workspace"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-databricks#/policy/types/databricksWorkspaceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-datafactory-factory"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-datafactory#/policy/types/factoryApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-firewall"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-firewall#/policy/types/firewallApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-key"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-keyvault#/policy/types/keyApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-secret"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-keyvault#/policy/types/secretApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-vault"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-keyvault#/policy/types/vaultApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-loadbalancer"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-loadbalancer#/policy/types/loadBalancerApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-loganalytics-workspace"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-loganalytics#/policy/types/logAnalyticsWorkspaceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-mysql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-mysql#/policy/types/serverApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-application-security-group"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/applicationSecurityGroupApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-interface"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/networkInterfaceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-security-groups"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/networkSecurityGroupApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-public-ip-address"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/publicIpAddressApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-route-table"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/routeTableApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-network-virtual-network"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/virtualNetworkApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-networkwatcher"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-networkwatcher#/policy/types/networkWatcherApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-postgresql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-recoveryservice-vault"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-recoveryservice#/policy/types/vaultApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-searchmanagement-search-service"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-searchmanagement#/policy/types/searchServiceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-elastic-pool"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/elasticPoolApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-storage-storage-account"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["azure-synapseanalytics-workspace"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-synapseanalytics#/policy/types/synapseWorkspaceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.azure_regions will be created
  + resource "turbot_smart_folder" "azure_regions" {
      + description = "Defines sets of policies for the Azure check regions baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Check Regions Policies"
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.azure_regions: Creating...
turbot_smart_folder.azure_regions: Creation complete after 2s [id=216451878998774]
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-key"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-plan"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-cosmosdb-database"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-interface"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk-encryption-set"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-availability-set"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-aks-managed-cluster"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-elastic-pool"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-security-groups"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-secret"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-aks-managed-cluster"]: Creation complete after 2s [id=216451882194692]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-interface"]: Creation complete after 2s [id=216451882334996]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-synapseanalytics-workspace"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-elastic-pool"]: Creation complete after 2s [id=216451882589983]
turbot_policy_setting.azure_approved_regions: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-secret"]: Creation complete after 2s [id=216451882195717]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk-encryption-set"]: Creation complete after 2s [id=216451882707747]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-network-security-groups"]: Creation complete after 2s [id=216451882787624]
turbot_policy_setting.set_resource_approved_regions_policies["azure-storage-storage-account"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-firewall"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-snapshot"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-plan"]: Creation complete after 2s [id=216451882231563]
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-key"]: Creation complete after 2s [id=216451881905916]
turbot_policy_setting.set_resource_approved_regions_policies["azure-cosmosdb-database"]: Creation complete after 2s [id=216451882322706]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-availability-set"]: Creation complete after 2s [id=216451882429209]
turbot_policy_setting.set_resource_approved_regions_policies["azure-searchmanagement-search-service"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-loganalytics-workspace"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-server"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-networkwatcher"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-synapseanalytics-workspace"]: Creation complete after 2s [id=216451884063533]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-disk"]: Creation complete after 2s [id=216451884115762]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-public-ip-address"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-mysql-server"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-server"]: Creation complete after 2s [id=216451884589883]
turbot_policy_setting.set_resource_approved_regions_policies["azure-firewall"]: Creation complete after 2s [id=216451884595004]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-virtual-machine"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-application-gateway"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-searchmanagement-search-service"]: Creation complete after 2s [id=216451884735302]
turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-function-app"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-networkwatcher"]: Creation complete after 2s [id=216451884780368]
turbot_policy_setting.set_resource_approved_regions_policies["azure-loganalytics-workspace"]: Creation complete after 2s [id=216451884864345]
turbot_policy_setting.set_resource_approved_regions_policies["azure-recoveryservice-vault"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-vault"]: Creating...
turbot_policy_setting.azure_approved_regions: Creation complete after 2s [id=216451884734277]
turbot_policy_setting.set_resource_approved_regions_policies["azure-storage-storage-account"]: Creation complete after 3s [id=216451884845910]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-snapshot"]: Creation complete after 3s [id=216451884772172]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-application-security-group"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-database"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-image"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-virtual-machine"]: Creation complete after 2s [id=216451886232419]
turbot_policy_setting.set_resource_approved_regions_policies["azure-postgresql-server"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-application-gateway"]: Creation complete after 2s [id=216451886489455]
turbot_policy_setting.set_resource_approved_regions_policies["azure-appservice-function-app"]: Creation complete after 2s [id=216451886493552]
turbot_policy_setting.set_resource_approved_regions_policies["azure-loadbalancer"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-route-table"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-mysql-server"]: Creation complete after 2s [id=216451886731127]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-virtual-network"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-sql-database"]: Creation complete after 2s [id=216451887144834]
turbot_policy_setting.set_resource_approved_regions_policies["azure-apimanagement-service"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-keyvault-vault"]: Creation complete after 3s [id=216451887162244]
turbot_policy_setting.set_resource_approved_regions_policies["azure-datafactory-factory"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-public-ip-address"]: Creation complete after 3s [id=216451886393195]
turbot_policy_setting.set_resource_approved_regions_policies["azure-application-insights-insight"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-recoveryservice-vault"]: Creation complete after 3s [id=216451886953342]
turbot_policy_setting.set_resource_approved_regions_policies["azure-databricks-workspace"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-route-table"]: Creation complete after 1s [id=216451887936396]
turbot_policy_setting.set_resource_approved_regions_policies["azure-compute-image"]: Creation complete after 3s [id=216451888295827]
turbot_policy_setting.set_resource_approved_regions_policies["azure-loadbalancer"]: Creation complete after 2s [id=216451888379807]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-virtual-network"]: Creation complete after 2s [id=216451888492452]
turbot_policy_setting.set_resource_approved_regions_policies["azure-network-application-security-group"]: Creation complete after 3s [id=216451888342935]
turbot_policy_setting.set_resource_approved_regions_policies["azure-postgresql-server"]: Creation complete after 2s [id=216451888356250]
turbot_policy_setting.set_resource_approved_regions_policies["azure-databricks-workspace"]: Creation complete after 1s [id=216451889032111]
turbot_policy_setting.set_resource_approved_regions_policies["azure-apimanagement-service"]: Creation complete after 1s [id=216451888994219]
turbot_policy_setting.set_resource_approved_regions_policies["azure-datafactory-factory"]: Creation complete after 1s [id=216451889043378]
turbot_policy_setting.set_resource_approved_regions_policies["azure-application-insights-insight"]: Creation complete after 1s [id=216451889105848]

Apply complete! Resources: 39 added, 0 changed, 0 destroyed.

Outputs:

resource_approved_regions = {
  "azure-aks-managed-cluster" = "Check: Approved"
  "azure-apimanagement-service" = "Check: Approved"
  "azure-application-gateway" = "Check: Approved"
  "azure-application-insights-insight" = "Check: Approved"
  "azure-appservice-function-app" = "Check: Approved"
  "azure-appservice-plan" = "Check: Approved"
  "azure-compute-availability-set" = "Check: Approved"
  "azure-compute-disk" = "Check: Approved"
  "azure-compute-disk-encryption-set" = "Check: Approved"
  "azure-compute-image" = "Check: Approved"
  "azure-compute-snapshot" = "Check: Approved"
  "azure-compute-virtual-machine" = "Check: Approved"
  "azure-cosmosdb-database" = "Check: Approved"
  "azure-databricks-workspace" = "Check: Approved"
  "azure-datafactory-factory" = "Check: Approved"
  "azure-firewall" = "Check: Approved"
  "azure-keyvault-key" = "Check: Approved"
  "azure-keyvault-secret" = "Check: Approved"
  "azure-keyvault-vault" = "Check: Approved"
  "azure-loadbalancer" = "Check: Approved"
  "azure-loganalytics-workspace" = "Check: Approved"
  "azure-mysql-server" = "Check: Approved"
  "azure-network-application-security-group" = "Check: Approved"
  "azure-network-network-interface" = "Check: Approved"
  "azure-network-network-security-groups" = "Check: Approved"
  "azure-network-public-ip-address" = "Check: Approved"
  "azure-network-route-table" = "Check: Approved"
  "azure-network-virtual-network" = "Check: Approved"
  "azure-networkwatcher" = "Check: Approved"
  "azure-postgresql-server" = "Check: Approved"
  "azure-recoveryservice-vault" = "Check: Approved"
  "azure-searchmanagement-search-service" = "Check: Approved"
  "azure-sql-database" = "Check: Approved"
  "azure-sql-elastic-pool" = "Check: Approved"
  "azure-sql-server" = "Check: Approved"
  "azure-storage-storage-account" = "Check: Approved"
  "azure-synapseanalytics-workspace" = "Check: Approved"
}
resource_approved_regions_region_list = [
  "eastus",
  "eastus2",
]
smart_folder_description = Defines sets of policies for the Azure check regions baseline
smart_folder_name = Azure Check Regions Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher